{
    "dialogue_lines": [
      ["Eva", "There she is. Miss 'I’ll be outside in 2 minutes' — it’s been ten."],
      ["Sanja", "Okay but like, I was being productive. I was panicking and rewriting my intro slide."],
      ["Eva", "Productive panic. My favorite academic genre."],
      ["Eva", "Be real — how much of your part did you actually finish?"],
      ["Sanja", "Uh...."],
      ["narration", "(They turn onto the main road toward campus. Streetlights flicker on. The glow of Srekja is just a few blocks away.)"],
      ["Eva", "Okay, so we’re walking in, pretending we’re calm, and then forcing everyone to stay focused for at least one hour."],
      ["Sanja", "One whole hour? That’s ambitious."],
      ["Eva", "...Fine. Thirty minutes and one coffee refill. Let’s go."],
      ["Sanja", "You know Tina’s gonna derail the whole thing with some ‘what if we add this last-minute’ idea."],
      ["Eva", "Oh absolutely. And Anja’s gonna be calm about it while silently fixing all our slides."],
      ["Sanja", "Marta’s probably already rewriting the conclusion again..."],
      ["Eva", "Which I will pretend to love because I am a supportive teammate."],
      ["narration", "What to say next?"]
    ],
  
    "choice_sets": [
      ["80%", "Be honest", "admit you don't like what you wrote"],
      ["I love how chaotic we are. It kinda works.", "We’re so doomed and it’s beautiful.", "Wait… did anyone bring the printed outline for the professor?"]
    ],
  
    "response_dialogue": [
      [
        ["Sanja", "Like... 80%. Just needs a little polishing."],
        ["Eva", "That’s more than I expected. We might actually pull this off."],
        ["Sanja", "Don’t jinx it."]
      ],
      [
        ["Sanja", "Honestly? I’m praying to the Google Slides gods during the ride."],
        ["Eva", "Bold of you to assume Srekja Wi-Fi will let us upload anything."],
        ["Sanja", "Okay now I’m actually scared."]
      ],
      [
        ["Sanja", "I finished it but I already hate everything I wrote."],
        ["Eva", "That’s the spirit of academia right there."],
        ["Sanja", "Burnout with a sprinkle of impostor syndrome."]
      ],
      [
        ["Sanja", "I love how chaotic we are. It kinda works."],
        ["Eva", "It's the academic version of jazz — messy but full of feeling."],
        ["Sanja", "Let’s hope the professor agrees."]
      ],
      [
        ["Sanja", "We’re so doomed and it’s beautiful."],
        ["Eva", "Like a tragic group project opera."],
        ["Sanja", "Cue dramatic music as we walk into Srekja."]
      ],
      [
        ["Sanja", "Wait… did anyone bring the printed outline for the professor?"],
        ["Eva", "...Was that not *your* job?"],
        ["Sanja", "OH NO—"],
        ["Eva", "Kidding. Tina printed five. Queen of preparation."]
      ]
    ]
  }
  