{
  "dialogue_lines": [
    [
      "Anja",
      "I can't believe we're presenting today. My stomach is already doing flips."
    ],
    [
      "Marta",
      "You've got this. Besides, we rehearsed like five times."
    ],
    [
      "Anja",
      "Yeah, but what if the projector fails? Or I blank out?"
    ],
    [
      "Marta",
      "Then I'll jump in and distract them with my charm. Obviously."
    ],
    [
      "Anja",
      "Oh my hahah"
    ],
    [
      "Marta",
      "Relax. Once we get coffee, your whole vibe will reset."
    ]
  ],
  "choice_sets": [
    [
      "I just want this to be over so we can celebrate.",
      "Only if the coffee is spiked with liquid courage",
      "What if it’s a total disaster though?"
    ],
    [
       "I’m scared I’ll mess up in front of everyone.",
       "Just mentally organizing my chaos.",
       "Wait, is the last homework uploaded?!?"
    ]
  ],
  "response_dialogue": [
   [
      ["Marta", "Exactly! We’re gonna ace it, then it’s cocktails and gossip time. I already picked out the perfect bar."],
      ["Anja", "Ahh I can't wait!"]
    ],
    [
      ["Marta", "If you sneak Baileys into your latte, I’m telling—but like, in a supportive way."],
      ["Anja", "Honestly though, caffeine is all the courage we need today."]
    ],
    [
      ["Marta", "Then we handle it, like we always do. You’re not doing this alone, We are all with you the whole time."],
      ["Anja", "I know I know..."]
    ],
    [
      ["Marta", "You’re allowed to be scared, but don’t forget—you’re also prepared."],
      ["Marta", "You’ve worked hard for this, and that’s what people will see."]
    ],
    [
      ["Marta", "Color-coded chaos or just vibes? Either way, as long as you leave room for caffeine and brilliance, we’re fine."],
      ["Anja", "Caffeine’s already booked the front row. Chaos can stand in the back."]
    ],
    [
      ["Marta", "Yes, I checked, like, three times. Breathe."],
      ["Anja", "If it’s not, we ride or die together. I’m not going down alone for this group grade."],
      ["Marta", "Girl, if it’s not, we’re uploading it from the parking lot. Wi-Fi and panic mode: activated."]
    ]
  ]
}