{
    "dialogue_lines": [
      [
        "Eva",
       "There she is. Miss 'I’ll be outside in 2 minutes' — it’s been ten."
      ],
      [
        "Sanja", 
        "Okay but like, I was being productive. I was panicking and rewriting my intro slide."
      ],
      [
        "Eva", 
        "Productive panic. My favorite academic genre."
      ],
      [
        "Eva", 
        "Be real — how much of your part did you actually finish?"
      ],
      [
        "Sanja", 
        "Uh....like 90%"
      ],
      [
        "narration", 
        "(They turn onto the main road toward uni. Streetlights flicker on. The glow of Srekja is just a few blocks away.)"
      ],
      [
        "Eva",
         "Okay, so we’re walking in, pretending we’re calm, and then forcing everyone to stay focused for at least one hour."
        ],
      [
        "Sanja",
         "One whole hour? That’s ambitious."
        ],
      [
        "Eva", "...Fine. Thirty minutes and one coffee refill. Let’s go."
      ],
      [
        "Sanja", 
        "You know Tina’s gonna derail the whole thing with some ‘what if we add this last-minute’ idea."
      ],
      [
        "Eva", "Oh absolutely. And Anja’s gonna be calm about it while silently fixing all our slides."
      ],
      [
        "Sanja", 
        "Marta’s probably already rewriting the conclusion again..."
      ],
      [
        "Eva", "Which I will pretend to love because I am a supportive teammate."
      ],
      [
        "narration",
         "What to say next?"
        ]
    ],
  
    "choice_sets": [

      "Joke about just winging the whole thing",
      "Ask Sanja if she brought snacks",
      "Vent about staying up late fixing the dialog code"
    ],
  
    "response_dialogue": [
     
      [
        [
          "Eva",
          "Honestly? If we wing it with enough confidence, they'll think it's a creative choice."
        ],
        [
          "Sanja", 
          "Spoken like someone who’s done that before."
        ],
        [
          "Eva", 
          "Maybe... a few times."
        ]
      ],
      [
        [
          "Eva",
          "Please tell me you brought snacks."
        ],
        [
          "Sanja",
          "Girl… I literally brought dark chocolate and espresso shots."
        ],
        [
          "Eva",
          "That’s the most chaotic combo and I respect it."
        ],
        [
          "Sanja",
          "You’re welcome in advance."
        ]
      ],
      [
        [
          "Eva",
          "I stayed up until 3am just fixing the dialog code."
        ],
        [
          "Sanja",
          "Wait, you were still coding last night?"
        ],
        [
          "Eva",
          "Marta added something and crashed the whole thing so I was helping her."
        ],
        [
          "Eva",
          "Eva", "At this point I’m just emotionally attached to debugging it."
        ]
      ]
    ]
  }
  